============
Variables definitons
============

TEST := adpfah32871'45$¨.¨.¨.
TEST2 = adpfah32871'45$¨.¨.¨.
HELLO += apdfhpa3290'456'5*%"¨245245¨üö¨2345¨.2¨4k,52,34.52.456¨
TUP_TEST = hi
&ref += dhpah
---

(tupfile
    (variable_statement
        (identifier
            (normal))
        (operators) (string))
    (variable_statement
        (identifier
            (normal))
        (operators) (string))
    (variable_statement
        (identifier
            (normal))
        (operators) (string))
    (variable_statement
        (identifier
            (tup_identifier))
        (operators) (string))
    (variable_statement
        (identifier
            (reference))
        (operators) (string))
        )

============
Variable usage
============
: |> $(hi_test) |>
: |> @(hi_test) |>
: |> &(hi) |>

---
(tupfile
    (rule
        (arrow)
        (command)
        (variable_reference
            (normal))
        (arrow))
    (rule
        (arrow)
        (command)
        (variable_reference
            (normal))
        (arrow))
    (rule
        (arrow)
        (command)
        (variable_reference
            (normal))
        (arrow)))

============
%-Flags in var names
============

: |> &(hi_%o) |>

---
(tupfile
    (rule
        (arrow)
        (command)
        (variable_reference
            (normal)
            (array_percent_flag))
        (arrow)))

============
Use variables in variable names
============

hi-$(hi) = hi

---

(tupfile
    (variable_statement
        (identifier
            (normal)
            (variable_reference
                (normal)))
        (operators) (string)))
